-- MySQL dump 10.13  Distrib 8.0.43, for macos15 (arm64)
--
-- Host: localhost    Database: foodiehub
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `ai_review_summary`
--

LOCK TABLES `ai_review_summary` WRITE;
/*!40000 ALTER TABLE `ai_review_summary` DISABLE KEYS */;
/*!40000 ALTER TABLE `ai_review_summary` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `board`
--

LOCK TABLES `board` WRITE;
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
/*!40000 ALTER TABLE `board` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `image`
--

LOCK TABLES `image` WRITE;
/*!40000 ALTER TABLE `image` DISABLE KEYS */;
INSERT INTO `image` VALUES (5,91,'1761536782446_700804.png','/uploads/review/1761536782446_700804.png','image/png','2025-10-27 12:46:22'),(6,91,'1761536782451_1912353.png','/uploads/review/1761536782451_1912353.png','image/png','2025-10-27 12:46:22'),(7,91,'1761536782452_ab58defb-672f-4df5-a0ad-a8bb9b80c06e.png','/uploads/review/1761536782452_ab58defb-672f-4df5-a0ad-a8bb9b80c06e.png','image/png','2025-10-27 12:46:22');
/*!40000 ALTER TABLE `image` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `restaurant`
--

LOCK TABLES `restaurant` WRITE;
/*!40000 ALTER TABLE `restaurant` DISABLE KEYS */;
INSERT INTO `restaurant` VALUES (8,NULL,'맛나분식','가성비 좋은 분식집','서울시 마포구 서교동 12-3','서울','분식',37.5501,126.9102,'/images/sample1.jpg','2025-10-26 22:39:12'),(9,NULL,'한우정육식당','신선한 한우를 직접 구워먹는 고기집','서울시 강남구 역삼동 45-8','서울','고기',37.4998,127.0364,'/images/sample2.jpg','2025-10-26 22:39:12'),(10,NULL,'스시야','정통 일식 초밥 전문점','서울시 종로구 관철동 11-2','서울','일식',37.5705,126.9813,'/images/sample3.jpg','2025-10-26 22:39:12'),(11,NULL,'피자몬스터','화덕에서 구운 이탈리안 피자 전문점','경기도 수원시 영통구 영통로 55','경기','양식',37.2595,127.0459,'/images/sample4.jpg','2025-10-26 22:39:12'),(12,NULL,'김가네밥상','가정식 백반 전문 한식당','서울시 동작구 사당동 210-5','서울','한식',37.4763,126.9828,'/images/sample5.jpg','2025-10-26 22:39:12'),(13,NULL,'춘리짜장','중국 본토식 중화요리 전문점','부산시 해운대구 우동 1400','부산','중식',35.1633,129.1635,'/images/sample6.jpg','2025-10-26 22:39:12'),(14,NULL,'오사카라멘','진한 돈코츠 라멘과 교자를 즐길 수 있는 곳','서울시 서초구 반포동 65-12','서울','일식',37.5057,127.0117,'/images/sample7.jpg','2025-10-26 22:39:12'),(15,NULL,'브런치데이','브런치와 커피가 맛있는 카페','경기도 성남시 분당구 정자동 22-1','경기','양식',37.3604,127.1153,'/images/sample8.jpg','2025-10-26 22:39:12'),(16,NULL,'돈까스하우스','두툼한 수제 돈까스 전문점','서울시 송파구 잠실동 38-9','서울','일식',37.5131,127.1002,'/images/sample9.jpg','2025-10-26 22:39:12'),(17,NULL,'라멘이찌','라멘 덕후들이 인정한 일본 라멘집','서울시 마포구 합정동 71-3','서울','일식',37.5507,126.9148,'/images/sample10.jpg','2025-10-26 22:39:12'),(18,NULL,'부산밀면','시원한 육수의 부산 전통 밀면','부산시 중구 남포동 23-2','부산','한식',35.1009,129.0321,'/images/sample11.jpg','2025-10-26 22:39:12'),(19,NULL,'치킨플래닛','다양한 시즈닝 치킨 전문점','서울시 관악구 봉천동 910-4','서울','기타',37.4849,126.9517,'/images/sample12.jpg','2025-10-26 22:39:12'),(20,NULL,'한남돈부리','정갈한 덮밥과 튀김을 즐길 수 있는 일식당','서울시 용산구 한남동 82-4','서울','일식',37.535,127.004,'/images/sample13.jpg','2025-10-26 22:39:12'),(21,NULL,'더테이블','이탈리안 캐주얼 다이닝 레스토랑','경기도 고양시 일산동구 중앙로 112','경기','양식',37.6586,126.8323,'/images/sample14.jpg','2025-10-26 22:39:12'),(22,NULL,'용궁횟집','신선한 회와 해산물 전문점','부산시 수영구 광안동 125-3','부산','한식',35.1555,129.1155,'/images/sample15.jpg','2025-10-26 22:39:12'),(23,NULL,'한촌설렁탕','전통 설렁탕과 수육이 맛있는 집','서울시 강북구 미아동 130-1','서울','한식',37.6278,127.0256,'/images/sample16.jpg','2025-10-26 22:39:12'),(24,NULL,'마라탕명가','얼얼한 사천식 마라탕 전문점','서울시 관악구 신림동 92-2','서울','중식',37.483,126.929,'/images/sample17.jpg','2025-10-26 22:39:12'),(25,NULL,'하와이포케','신선한 재료로 만든 포케 전문점','제주시 연동 45-3','제주','양식',33.489,126.498,'/images/sample18.jpg','2025-10-26 22:39:12'),(26,NULL,'홍콩반점','짬뽕과 탕수육이 맛있는 중식 프랜차이즈','서울시 구로구 구로동 120-2','서울','중식',37.4921,126.8899,'/images/sample19.jpg','2025-10-26 22:39:12'),(27,NULL,'카레스토리','매운 카레와 돈까스의 조합','서울시 강서구 화곡동 65-10','서울','일식',37.5403,126.8369,'/images/sample20.jpg','2025-10-26 22:39:12'),(30,NULL,'마포한우집','신선한 한우를 맛볼 수 있는 정통 한식당','서울 마포구 연남동 123-1','서울','한식',37.5534,126.9368,'/images/seoul_1.jpg','2025-10-26 23:52:32'),(31,NULL,'홍대텐동','가성비 좋은 일본식 덮밥 전문점','서울 마포구 서교동 456-2','서울','일식',37.5559,126.9238,'/images/seoul_2.jpg','2025-10-26 23:52:32'),(32,NULL,'해운대밀면','시원한 밀면과 돼지국밥 전문점','부산 해운대구 우동 301-3','부산','한식',35.1631,129.1635,'/images/busan_1.jpg','2025-10-26 23:52:32'),(33,NULL,'광안리버거','수제버거와 칵테일을 즐길 수 있는 해변 레스토랑','부산 수영구 광안해변로 219','부산','양식',35.1539,129.1188,'/images/busan_2.jpg','2025-10-26 23:52:32'),(34,NULL,'중앙떡볶이','대구 명물 즉석 떡볶이 전문점','대구 중구 동성로 12','대구','분식',35.8693,128.6018,'/images/daegu_1.jpg','2025-10-26 23:52:32'),(35,NULL,'교동짬뽕','불향 가득한 해물짬뽕 전문점','대구 수성구 교동로 55','대구','중식',35.8449,128.6177,'/images/daegu_2.jpg','2025-10-26 23:52:32'),(36,NULL,'송도스시','프리미엄 오마카세 스시 레스토랑','인천 연수구 송도동 155-1','인천','일식',37.3879,126.6396,'/images/incheon_1.jpg','2025-10-26 23:52:32'),(37,NULL,'차이나하우스','정통 광둥식 요리를 맛볼 수 있는 중식당','인천 남동구 구월동 204-2','인천','중식',37.4471,126.7052,'/images/incheon_2.jpg','2025-10-26 23:52:32'),(38,NULL,'무등산한정식','광주 전통의 맛을 살린 한정식 전문점','광주 동구 충장로 85','광주','한식',35.1485,126.9187,'/images/gwangju_1.jpg','2025-10-26 23:52:32'),(39,NULL,'상무카페거리','디저트와 브런치가 인기인 감성 카페','광주 서구 상무중앙로 44','광주','카페',35.1548,126.8531,'/images/gwangju_2.jpg','2025-10-26 23:52:32'),(40,NULL,'성심돈까스','40년 전통의 바삭한 일식 돈까스','대전 서구 둔산동 101-1','대전','일식',36.351,127.385,'/images/daejeon_1.jpg','2025-10-26 23:52:32'),(41,NULL,'둔산브루어리','수제맥주와 안주를 즐길 수 있는 펍','대전 서구 대덕대로 200','대전','술집',36.3542,127.3764,'/images/daejeon_2.jpg','2025-10-26 23:52:32'),(42,NULL,'울산횟집','싱싱한 회와 해산물 요리 전문','울산 남구 삼산로 88','울산','해산물',35.5384,129.3114,'/images/ulsan_1.jpg','2025-10-26 23:52:32'),(43,NULL,'공업탑커피','로스터리 원두 전문 카페','울산 남구 삼산로 142','울산','카페',35.5417,129.3385,'/images/ulsan_2.jpg','2025-10-26 23:52:32'),(44,NULL,'세종국밥','깔끔한 한우 국밥과 수육정식','세종특별자치시 조치원읍 세종로 123','세종','한식',36.6001,127.2985,'/images/sejong_1.jpg','2025-10-26 23:52:32'),(45,NULL,'버거시티세종','미국 스타일 수제버거 전문점','세종특별자치시 아름동 89','세종','패스트푸드',36.5022,127.2498,'/images/sejong_2.jpg','2025-10-26 23:52:32'),(46,NULL,'수원갈비명가','40년 전통의 소갈비 전문점','경기 수원시 영통구 중부대로 24','경기','한식',37.2636,127.0286,'/images/gyeonggi_1.jpg','2025-10-26 23:52:32'),(47,NULL,'판교디저트라운지','감각적인 케이크 & 디저트 카페','경기 성남시 분당구 판교역로 125','경기','디저트',37.3943,127.1116,'/images/gyeonggi_2.jpg','2025-10-26 23:52:32'),(48,NULL,'춘천닭갈비골목','춘천 대표 닭갈비 전문점','강원 춘천시 명동길 12','강원','한식',37.8813,127.7298,'/images/gangwon_1.jpg','2025-10-26 23:52:32'),(49,NULL,'양양비치브런치','바다가 보이는 브런치 카페','강원 양양군 낙산해변길 88','강원','양식',38.0756,128.6276,'/images/gangwon_2.jpg','2025-10-26 23:52:32'),(50,NULL,'청주짬뽕타운','얼큰한 불짬뽕이 인기 메뉴','충북 청주시 상당구 상당로 92','충북','중식',36.6351,127.4915,'/images/chungbuk_1.jpg','2025-10-26 23:52:32'),(51,NULL,'단양스테이크하우스','호숫가 전망의 스테이크 전문점','충북 단양군 단양읍 별곡리 22','충북','양식',36.9847,128.365,'/images/chungbuk_2.jpg','2025-10-26 23:52:32'),(52,NULL,'보령짬뽕상회','보령 해물짬뽕으로 유명한 중식당','충남 보령시 대천로 123','충남','중식',36.331,126.612,'/images/chungnam_1.jpg','2025-10-26 23:52:32'),(53,NULL,'공주한옥밥상','한옥 분위기의 전통 밥상집','충남 공주시 금성동 45','충남','한식',36.4461,127.1195,'/images/chungnam_2.jpg','2025-10-26 23:52:32'),(54,NULL,'전주비빔밥명가','전통 비빔밥의 원조','전북 전주시 완산구 중앙동 33','전북','한식',35.8174,127.153,'/images/jeonbuk_1.jpg','2025-10-26 23:52:32'),(55,NULL,'군산이탈리안','로맨틱한 분위기의 이탈리안 레스토랑','전북 군산시 대학로 77','전북','양식',35.9674,126.7369,'/images/jeonbuk_2.jpg','2025-10-26 23:52:32'),(56,NULL,'여수낭만포차','여수밤바다 포차거리 대표 메뉴 모듬안주','전남 여수시 하멜로 12','전남','술집',34.7391,127.7452,'/images/jeonnam_1.jpg','2025-10-26 23:52:32'),(57,NULL,'순천카페거리','감성 가득한 디저트 카페','전남 순천시 조례동 56','전남','카페',34.9481,127.489,'/images/jeonnam_2.jpg','2025-10-26 23:52:32'),(58,NULL,'경주불고기집','전통 불고기 한상차림 전문','경북 경주시 포석로 123','경북','한식',35.8428,129.212,'/images/gyeongbuk_1.jpg','2025-10-26 23:52:32'),(59,NULL,'포항피자팝','이탈리아 정통 피자 레스토랑','경북 포항시 북구 중앙로 45','경북','양식',36.0332,129.3656,'/images/gyeongbuk_2.jpg','2025-10-26 23:52:32'),(60,NULL,'창원통영회센터','통영산 신선한 회와 해물요리','경남 창원시 성산구 상남동 88','경남','해산물',35.2239,128.6813,'/images/gyeongnam_1.jpg','2025-10-26 23:52:32'),(61,NULL,'진주순댓국','담백한 돼지국밥과 순댓국 전문','경남 진주시 동성동 21','경남','한식',35.1802,128.1076,'/images/gyeongnam_2.jpg','2025-10-26 23:52:32'),(62,NULL,'성산갈치조림','제주 바다의 갈치로 만든 조림정식','제주 서귀포시 성산읍 고성리 322','제주','해산물',33.4611,126.933,'/images/jeju_1.jpg','2025-10-26 23:52:32'),(63,NULL,'제주시카페바다','오션뷰가 아름다운 디저트 카페','제주 제주시 애월읍 하귀리 122','제주','디저트',33.4806,126.4049,'/images/jeju_2.jpg','2025-10-26 23:52:32');
/*!40000 ALTER TABLE `restaurant` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `review`
--

LOCK TABLES `review` WRITE;
/*!40000 ALTER TABLE `review` DISABLE KEYS */;
INSERT INTO `review` VALUES (21,8,1,NULL,'분식 메뉴가 다양하고 가격도 저렴해서 자주 갑니다.',5,0,'2025-10-26 23:57:14'),(22,8,2,NULL,'떡볶이 맛있는데 자리가 조금 좁아요.',4,0,'2025-10-26 23:57:14'),(23,9,3,NULL,'한우가 정말 신선합니다. 재방문 의사 있어요.',5,0,'2025-10-26 23:57:14'),(24,9,10,NULL,'가격이 좀 있지만 고기 퀄리티는 최고예요.',4,0,'2025-10-26 23:57:14'),(25,10,11,NULL,'초밥 신선도 대박이에요. 셰프님 친절합니다.',5,0,'2025-10-26 23:57:14'),(26,10,1,NULL,'조용한 분위기에서 식사하기 좋아요.',4,0,'2025-10-26 23:57:14'),(27,12,2,NULL,'가정식 느낌의 한식당이에요. 반찬도 깔끔합니다.',5,0,'2025-10-26 23:57:14'),(28,12,3,NULL,'점심 시간엔 줄 서야 하지만 기다릴 가치 있어요.',4,0,'2025-10-26 23:57:14'),(29,14,10,NULL,'라멘 국물 진하고 면발 탱탱해요.',5,0,'2025-10-26 23:57:14'),(30,14,11,NULL,'교자도 괜찮았어요. 양이 많아요.',4,0,'2025-10-26 23:57:14'),(31,11,1,NULL,'피자가 진짜 화덕 느낌 제대로입니다.',5,0,'2025-10-26 23:57:14'),(32,11,2,NULL,'사람이 많아서 조금 기다렸어요.',4,0,'2025-10-26 23:57:14'),(33,15,3,NULL,'브런치랑 커피 조합이 완벽합니다.',5,0,'2025-10-26 23:57:14'),(34,15,10,NULL,'인스타 감성 카페예요. 분위기 좋아요.',4,0,'2025-10-26 23:57:14'),(35,21,11,NULL,'파스타가 정말 맛있어요. 추천합니다.',5,0,'2025-10-26 23:57:14'),(36,21,1,NULL,'조용한 분위기에서 식사하기 좋아요.',4,0,'2025-10-26 23:57:14'),(37,13,2,NULL,'짜장 진짜 본토 느낌이에요.',5,0,'2025-10-26 23:57:14'),(38,13,3,NULL,'양이 많고 가성비 좋아요.',4,0,'2025-10-26 23:57:14'),(39,22,10,NULL,'회가 싱싱하고 뷰가 멋집니다.',5,0,'2025-10-26 23:57:14'),(40,22,11,NULL,'광안대교 보면서 식사하니 분위기 좋아요.',5,0,'2025-10-26 23:57:14'),(41,34,1,NULL,'즉석 떡볶이 최고예요. 매운맛 조절 가능!',5,0,'2025-10-26 23:57:14'),(42,35,2,NULL,'짬뽕 국물 불향 제대로 납니다.',5,0,'2025-10-26 23:57:14'),(43,36,3,NULL,'스시 코스 구성 좋고 재료 신선해요.',5,0,'2025-10-26 23:57:14'),(44,37,10,NULL,'중식 퀄리티가 높아요. 가격대비 훌륭합니다.',4,0,'2025-10-26 23:57:14'),(45,38,11,NULL,'한정식 코스 훌륭해요. 부모님 모시기 좋습니다.',5,0,'2025-10-26 23:57:14'),(46,39,1,NULL,'디저트가 다양하고 분위기가 감성적이에요.',4,0,'2025-10-26 23:57:14'),(47,40,2,NULL,'돈까스 바삭하고 소스도 맛있어요.',5,0,'2025-10-26 23:57:14'),(48,41,3,NULL,'맥주 종류 다양하고 안주 퀄리티도 높아요.',5,0,'2025-10-26 23:57:14'),(49,42,10,NULL,'회 신선하고 양 많아요.',5,0,'2025-10-26 23:57:14'),(50,43,11,NULL,'커피 맛이 깊어요. 조용해서 좋습니다.',4,0,'2025-10-26 23:57:14'),(51,44,1,NULL,'국밥이 깔끔하고 속이 편해요.',5,0,'2025-10-26 23:57:14'),(52,45,2,NULL,'버거가 진짜 두껍고 수제 느낌나요.',5,0,'2025-10-26 23:57:14'),(53,48,3,NULL,'닭갈비 불맛 제대로입니다.',5,0,'2025-10-26 23:57:14'),(54,49,10,NULL,'바다 보며 먹는 브런치 최고예요.',5,0,'2025-10-26 23:57:14'),(55,54,11,NULL,'비빔밥 맛있고 반찬도 훌륭합니다.',5,0,'2025-10-26 23:57:14'),(56,55,1,NULL,'이탈리안 레스토랑 분위기 좋네요.',4,0,'2025-10-26 23:57:14'),(57,56,2,NULL,'포차 거리 분위기 그대로네요.',5,0,'2025-10-26 23:57:14'),(58,57,3,NULL,'카페 인테리어 예쁘고 조용합니다.',4,0,'2025-10-26 23:57:14'),(59,58,10,NULL,'불고기 한상 완벽합니다.',5,0,'2025-10-26 23:57:14'),(60,59,11,NULL,'피자 도우가 바삭하고 소스 맛있어요.',4,0,'2025-10-26 23:57:14'),(61,60,1,NULL,'회 신선하고 서비스 좋아요.',5,0,'2025-10-26 23:57:14'),(62,61,2,NULL,'순댓국 국물이 진하고 맛있어요.',5,0,'2025-10-26 23:57:14'),(63,25,3,NULL,'포케가 신선하고 재료가 다양해요.',5,0,'2025-10-26 23:57:14'),(64,62,10,NULL,'갈치조림 최고예요. 밥 두 공기 먹었습니다.',5,0,'2025-10-26 23:57:14'),(65,63,11,NULL,'오션뷰가 예술이에요. 케이크도 맛있어요.',5,0,'2025-10-26 23:57:14'),(76,8,2,21,'저도 이 분식집 자주 가요! 튀김도 맛있어요.',NULL,1,'2025-10-26 23:58:58'),(77,9,3,22,'한우 퀄리티 공감합니다. 서비스도 괜찮았어요.',NULL,1,'2025-10-26 23:58:58'),(78,10,10,24,'초밥 퀄리티 정말 좋아요. 예약 필수!',NULL,1,'2025-10-26 23:58:58'),(79,12,11,26,'여기 점심시간엔 늘 줄 서 있죠.',NULL,1,'2025-10-26 23:58:58'),(80,14,1,28,'라멘 국물 진짜 찐이에요. 교자도 괜찮아요.',NULL,1,'2025-10-26 23:58:58'),(81,21,2,31,'파스타 진짜 맛있어요. 플레이트도 예뻐요.',NULL,1,'2025-10-26 23:58:58'),(82,22,3,33,'광안대교 보면서 회 먹으니 기분 좋죠.',NULL,1,'2025-10-26 23:58:58'),(83,36,10,39,'스시 코스 구성이 훌륭했어요. 스페셜 강추.',NULL,1,'2025-10-26 23:58:58'),(84,41,11,44,'여기 맥주 라인업 최고예요.',NULL,1,'2025-10-26 23:58:58'),(85,49,1,48,'양양에서 브런치 먹기엔 여기만 한 곳이 없어요.',NULL,1,'2025-10-26 23:58:58'),(86,55,2,51,'군산 이탈리안 레스토랑 중에 여기가 제일 괜찮아요.',NULL,1,'2025-10-26 23:58:58'),(87,60,3,56,'회도 신선하지만 서비스가 특히 좋아요.',NULL,1,'2025-10-26 23:58:58'),(88,63,10,65,'여기 디저트도 예술이에요. 강추합니다.',NULL,1,'2025-10-26 23:58:58'),(89,38,1,NULL,'리뷰작성',3,0,'2025-10-27 12:42:42'),(90,38,1,NULL,'리뷰작성',3,0,'2025-10-27 12:43:49'),(91,38,1,NULL,'리뷰작성',3,0,'2025-10-27 12:46:22'),(92,38,1,NULL,'ㅁㅇㄴㄹㅁㅇㄴㄹ',5,0,'2025-10-27 13:50:15'),(93,38,1,NULL,'ㅁㅇㄴㄹㅁㅇㄴㄹ',5,0,'2025-10-27 13:50:21');
/*!40000 ALTER TABLE `review` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'user01@example.com','user1234','김사용','1998-06-14','M','010-1234-5678','서울특별시 강남구 테헤란로 100',NULL,'local','ROLE_USER','N','2025-10-25 22:51:49'),(2,'owner01@example.com','owner1234','박사장','1985-02-21','F','010-9876-5432','부산광역시 해운대구 센텀중앙로 90',NULL,'local','ROLE_OWNER','N','2025-10-25 22:51:49'),(3,'admin01@example.com','admin1234','관리자','1990-01-01','OTHER','010-0000-0000','서울특별시 중구 세종대로 110',NULL,'local','ROLE_ADMIN','N','2025-10-25 22:51:49'),(10,'3mapper_test@example.com','1234','수정된테스트유저',NULL,NULL,NULL,NULL,'https://example.com/test.png','local','ROLE_ADMIN','Y','2025-10-26 01:01:51'),(11,'service_user@example.com','1234','수정된유저',NULL,NULL,NULL,NULL,'https://example.com/profile.png','local','ROLE_ADMIN','Y','2025-10-26 01:02:00');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-10-27 14:31:28
